Veen_OpenFOAM_Cases-main/2D_Plane_EE_Multiphase/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     twoPhaseEulerFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         50;

deltaT          1e-4;

writeControl    adjustableRunTime;

writeInterval   0.1;

purgeWrite      0;

writeFormat     ascii;
// writeFormat     binary;

writePrecision  9;

writeCompression off;

timeFormat      general;

timePrecision   8;

runTimeModifiable on;

adjustTimeStep  yes;

maxCo           5;

maxDeltaT       0.01;

functions
{
    // #include "include/probes"
    // #include "include/fieldAverage"
    // #includeFunc residuals
    // #includeFunc Q
}


// ************************************************************************* //
