Veen_OpenFOAM_Cases-main/2D_Plane_EE_Multiphase/0_org/T.air
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T.air;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions          [0 0 0 1 0 0 0];

internalField       uniform 300;

boundaryField
{
    inlet
    {
        type               fixedValue;
        value              uniform 300;
    }

    outlet
    {
        type               inletOutlet;
        phi                phi.air;
        inletValue         uniform 300;
        value              uniform 300;
    }

    land
    {
        type               zeroGradient;
    }

    plane
    {
        type               zeroGradient;
    }

    top
    {
        type               slip;
    }

    frontAndBack
    {
        type               empty;
    }
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
